## Series

In [31]:
import pandas as pd

In [32]:
## create a series from list
data = [1, 2, 3, 4, 5]
series = pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [33]:
## create a series from dictionary
data = {"a": 1, "b": 2, "c": 3}
series = pd.Series(data)
print(series)
print(type(series))

a    1
b    2
c    3
dtype: int64
<class 'pandas.core.series.Series'>

In [34]:
data = [10, 20, 30]
index = ["a", "b", "c"]
series = pd.Series(data, index)
print(series)

a    10
b    20
c    30
dtype: int64

In [35]:
series.loc["a"]

np.int64(10)

In [36]:
series.iloc[0]

np.int64(10)

## DataFrame

In [37]:
## create a dataframe from a dictionary of lists
data = {
    "name": ["Alya", "Andre", "Felicia", "Endriano", "Hana"],
    "age": [20, 19, 19, 19, 19],
    "city": ["Dumai", "Medan", "Kerinci", "Medan", "Medan"]
}

df = pd.DataFrame(data)

print(df)
print(type(df))

       name  age     city
0      Alya   20    Dumai
1     Andre   19    Medan
2   Felicia   19  Kerinci
3  Endriano   19    Medan
4      Hana   19    Medan
<class 'pandas.core.frame.DataFrame'>

In [38]:
import numpy as np

np.array(df)

array([['Alya', 20, 'Dumai'],
       ['Andre', 19, 'Medan'],
       ['Felicia', 19, 'Kerinci'],
       ['Endriano', 19, 'Medan'],
       ['Hana', 19, 'Medan']], dtype=object)

In [39]:
## create a dataframe from a list of dictionaries
data = [
    {
        "name": "Alya",
        "age": 20,
        "city": "Dumai"
    },
    {
        "name": "Andre",
        "age": 19,
        "city": "Medan"
    },
    {
        "name": "Felicia",
        "age": 19,
        "city": "Kerinci"
    },
    {
        "name": "Endriano",
        "age": 19,
        "city": "Medan"
    },
    {
        "name": "Hana",
        "age": 19,
        "city": "Medan"
    },
]

df = pd.DataFrame(data)

print(df)
print(type(df))

       name  age     city
0      Alya   20    Dumai
1     Andre   19    Medan
2   Felicia   19  Kerinci
3  Endriano   19    Medan
4      Hana   19    Medan
<class 'pandas.core.frame.DataFrame'>

In [40]:
## read csv file
df_csv = pd.read_csv("sales_data.csv")

print(df_csv.head())

   Transaction ID        Date Product Category             Product Name  \
0           10001  2024-01-01      Electronics            iPhone 14 Pro
1           10002  2024-01-02  Home Appliances         Dyson V11 Vacuum
2           10003  2024-01-03         Clothing         Levi's 501 Jeans
3           10004  2024-01-04            Books        The Da Vinci Code
4           10005  2024-01-05  Beauty Products  Neutrogena Skincare Set

   Units Sold  Unit Price  Total Revenue         Region Payment Method
0           2      999.99        1999.98  North America    Credit Card
1           1      499.99         499.99         Europe         PayPal
2           3       69.99         209.97           Asia     Debit Card
3           4       15.99          63.96  North America    Credit Card
4           1       89.99          89.99         Europe         PayPal

In [41]:
print(df_csv.tail())

     Transaction ID        Date Product Category  \
235           10236  2024-08-23  Home Appliances
236           10237  2024-08-24         Clothing
237           10238  2024-08-25            Books
238           10239  2024-08-26  Beauty Products
239           10240  2024-08-27           Sports

                                        Product Name  Units Sold  Unit Price  \
235  Nespresso Vertuo Next Coffee and Espresso Maker           1      159.99
236                        Nike Air Force 1 Sneakers           3       90.00
237           The Handmaid's Tale by Margaret Atwood           3       10.99
238             Sunday Riley Luna Sleeping Night Oil           1       55.00
239                       Yeti Rambler 20 oz Tumbler           2       29.99

     Total Revenue         Region Payment Method
235         159.99         Europe         PayPal
236         270.00           Asia     Debit Card
237          32.97  North America    Credit Card
238          55.00         Europe         PayPal
239          59.98           Asia    Credit Card

In [42]:
## accessing data from dataframe
df

       name  age     city
0      Alya   20    Dumai
1     Andre   19    Medan
2   Felicia   19  Kerinci
3  Endriano   19    Medan
4      Hana   19    Medan

In [43]:
df["name"]

0        Alya
1       Andre
2     Felicia
3    Endriano
4        Hana
Name: name, dtype: object

In [44]:
type(df["name"])

pandas.core.series.Series

In [45]:
## pilih baris ke 0
## loc = label-based, berdasarkan label indeks
df.loc[0]

name     Alya
age        20
city    Dumai
Name: 0, dtype: object

In [46]:
df.loc[0][0]

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7324\2527876973.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][0]

'Alya'

In [47]:
## pilih kolom ke 0
## iloc = integer-based, berdasarkan posisi numerik indeks
df.iloc[0]

name     Alya
age        20
city    Dumai
Name: 0, dtype: object

In [48]:
df.loc[0][2]

C:\Users\LENOVO\AppData\Local\Temp\ipykernel_7324\2880214942.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df.loc[0][2]

'Dumai'

In [51]:
## accessing a specified element
df.at[1, "name"]

'Andre'

In [56]:
## accessing specified element using iat
df.iat[2, 2]

'Kerinci'

In [57]:
df

       name  age     city
0      Alya   20    Dumai
1     Andre   19    Medan
2   Felicia   19  Kerinci
3  Endriano   19    Medan
4      Hana   19    Medan

In [ ]:
## data manipulation with dataframe

## adding a column
df["salary"] = [1000, 2000, 3000, 4000, 5000]

df

       name  age     city  salary
0      Alya   20    Dumai    1000
1     Andre   19    Medan    2000
2   Felicia   19  Kerinci    3000
3  Endriano   19    Medan    4000
4      Hana   19    Medan    5000

In [60]:
## remove a column
dropped = df.drop("salary", axis=1)

In [61]:
dropped

       name  age     city
0      Alya   20    Dumai
1     Andre   19    Medan
2   Felicia   19  Kerinci
3  Endriano   19    Medan
4      Hana   19    Medan

In [62]:
df

       name  age     city  salary
0      Alya   20    Dumai    1000
1     Andre   19    Medan    2000
2   Felicia   19  Kerinci    3000
3  Endriano   19    Medan    4000
4      Hana   19    Medan    5000

In [63]:
df.drop("salary", axis=1, inplace=True)

df

       name  age     city
0      Alya   20    Dumai
1     Andre   19    Medan
2   Felicia   19  Kerinci
3  Endriano   19    Medan
4      Hana   19    Medan

In [64]:
## add age to the column
df["age"] = df["age"] + 1

df

       name  age     city
0      Alya   21    Dumai
1     Andre   20    Medan
2   Felicia   20  Kerinci
3  Endriano   20    Medan
4      Hana   20    Medan

In [ ]:
## drop row
df.drop(0, inplace=True) ## default axis=0

df

       name  age     city
1     Andre   20    Medan
2   Felicia   20  Kerinci
3  Endriano   20    Medan
4      Hana   20    Medan

In [66]:
df = pd.read_csv("sales_data.csv")
df.head(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [67]:
df.tail(5)

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [68]:
## display the data types of each column
print("Data types:\n", df.dtypes)

## describe the dataframe
print("Statistical summary:\n", df.describe())

## group by a column and perform an aggregation
grouped = df.groupby("Product Category")["Unit Price"].mean()
print("Unit price mean by category:\n", grouped)

Data types:
 Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object
Statistical summary:
        Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000
Unit price mean by category:
 Product Category
Beauty Products     61.6230
Books               16.1530
Clothing            67.5365
Electronics        691.5915
Home Appliances    320.1855
Sports             261.2840
Name: Unit Price, dtype: float64